Repository: python/pootle-python-org-backup
Catalog: tmxes/de/faq.tmx
Source language: en
Languages: de

source: See the next question.
de: Die nächste Frage anzeigen.

source: There are several advantages.
de: Es gibt mehrere Vorteile.

source: which gives the result::
de: welches Ihnen dieses Ergebnis liefert:

source: Why isn't all memory freed when Python exits?
de: Weshalb wird nicht aller Speicher freigegeben, wenn Python beendet wird?

source: Objects referenced from the global namespaces of Python modules are not always deallocated when Python exits. This may happen if there are circular references. There are also certain bits of memory that are allocated by the C library that are impossible to free (e.g. a tool like Purify will complain about these). Python is, however, aggressive about cleaning up memory on exit and does try to destroy every single object.
de: Aus dem globalen Namensraum von Python-Modulen referenzierte Objekte werden nicht immer freigegeben, wenn Python beendet wird. Dies kann geschehen, wenn Kreisbezüge vorliegen. Es gibt auch bestimmte Teile des Speichers, die von der C-Bibliothek alloziert werden und unmöglich freigegeben werden können (z. B. wird sich ein Werkzeug wie Purify über diese beschweren). Python geht jedoch aggressiv bei der Reinigung des Speichers beim Verlassen vor und versucht jedes einzelne Objekt zu zerstören.

source: If you want to force Python to delete certain things on deallocation use the :mod:`atexit` module to run a function that will force those deletions.
de: Wenn Python gezwungen werden soll bestimmte Dinge bei Deallozierung zu löschen, nutze das :mod: `atexit` Modul um eine Funktion aufzurufen, die diese Löschungen erzwingt.

source: Why are there separate tuple and list data types?
de: Warum gibt es getrennte Tupel- und Listen-Datentypen?

source: Lists and tuples, while similar in many respects, are generally used in fundamentally different ways. Tuples can be thought of as being similar to Pascal records or C structs; they're small collections of related data which may be of different types which are operated on as a group. For example, a Cartesian coordinate is appropriately represented as a tuple of two or three numbers.
de: Listen und Tupel werden - obwohl in vielerlei Hinsicht ähnlich - generell auf grundsätzlich verschiedenen Wegen genutzt. Tupel kann man sich ähnlich den records von Pascal oder den structs von C vorstellen; Es sind kleine Sammlungen untereinander verwandter Daten, die von unterschiedlichem Typ sein können und auf denen Operationen als Gruppe angewendet werden. Zum Beispiel wird eine kartesische Koordinate angemessen durch ein Tupel von zwei oder drei Zahlen repräsentiert.

source: For Debian, run ``apt-get install python-dev``.
de: In Debian, führen Sie ``apt-get install python-dev`` aus.

source: General Python FAQ
de: Allgemeines Python FAQ

source: General Information
de: Allgemeine Informationen

source: What is Python?
de: Was ist Python?

source: What is Python good for?
de: Wofür ist Python gut?

source: How do I get documentation on Python?
de: Wie bekomme Ich Dokumentation zu Python?

source: How do I get a beta test version of Python?
de: Wie bekomme Ich eine beta Test-Version von Python?

source: No, but it helps. :)
de: Nein, aber es hilft. :)

source: How stable is Python?
de: Wie stabil ist Python?

source: How many people are using Python?
de: Wie viele Leute benutzen Python?

source: Is Python a good language for beginning programmers?
de: Ist Python eine gute Sprache für Programmieranfänger?

source: Yes.
de: Ja.

source: Upgrading Python
de: Python aktualisieren

source: Python Frequently Asked Questions
de: Python Häufig Gestellte Fragen

source: "Why is Python Installed on my Computer?" FAQ
de: "Warum ist Python auf meinem Rechner installiert?" FAQ

source: Can I delete Python?
de: Kann Ich Python löschen?

source: How do I copy a file?
de: Wie kopiere ich eine Datei?
